//基本类型和运算符
func numbers() {
	//类型转换
	//var a float32 = 100.1
	//将a转换为整型
	//b := int(a) //将输出100

	//整型转换为字符串,需要利用 strconv 包
	//var a int = 100
	//b := strconv.Itoa(a)

	//将字符串->整数
	//var c string = "100"
	//d := strconv.Atoi(c)

	/*
	   //整数：
	   int8（-128 -> 127）
	   int16（-32768 -> 32767）
	   int32（-2,147,483,648 -> 2,147,483,647）
	   int64（-9,223,372,036,854,775,808 -> 9,223,372,036,854,775,807）
	   //无符号整数：
	   uint8（0 -> 255）
	   uint16（0 -> 65,535）
	   uint32（0 -> 4,294,967,295）
	   uint64（0 -> 18,446,744,073,709,551,615）
	   //浮点型（IEEE-754 标准）：
	   float32（+- 1e-45 -> +- 3.4 * 1e38）
	   float64（+- 5 * 1e-324 -> 107 * 1e308）
	   //赋值
	   var b2 int32
	   var n int16 = 34
	*/
}
